// *? Напишіть код, який запитуватиме
// *? логін за допомогою prompt та логувати результат
// *? у консоль браузера

// *? Якщо відвідувач вводить "Адмін",
// *? то prompt запитує пароль.
// *? Якщо нічого не ввели або натиснуто клавішу Esc
// *? вивести рядок "Скасовано"
// *? В іншому випадку вивести рядок "Я вас не знаю"

// *? Пароль перевіряти так:
// *? Якщо введено пароль "Я головний",
// *? то вивести рядок "Здрастуйте!"
// *? інакше виводити рядок "Невірний пароль!"

const userAnswer = prompt("Введіть логін");
console.log(userAnswer);
if (userAnswer === "Адмін") {
  const password = prompt("Введіть пароль");
  console.log(password);
  if (password) {
    if (password === "Я головний") {
      console.log("Здрастуйте!");
    } else {
      console.log("Невірний пароль!");
    }
  } else {
    console.log("Скасовано");
  }
} else {
  alert("Я вас не знаю");
}
